{"sections":{"main":{"type":"main-page","disabled":true,"settings":{}},"387c97c7-7895-4e21-918a-ab0a3ccb8a3a":{"type":"section-rich-text","settings":{"full_width":false,"section_title":"TERMS AND CONDITIONS","text":"<p>These Terms and Conditions (“Terms”, “Terms and Conditions”) govern your relationship with <a href=\"https:\/\/eu.warmbody-coldmind.com\/\">https:\/\/eu.warmbody-coldmind.com<\/a> website (the “Service”) operated by WBCM LTD (“us”, “we”, or “our”), 46 st.leonards road Northampton nn4 8dp UK.<\/p><p>Please read these Terms and Conditions carefully before using the Service.<\/p><p>Your access to and use of the Service is conditioned on your acceptance of and compliance with these Terms. These Terms apply to all visitors, users and others who access or use the Service.<\/p><p>By accessing or using the Service you agree to be bound by these Terms. If you disagree with any part of the terms then you may not access the Service.<\/p><p><strong>​2.​ Validity of contract of sale, product and price information <\/strong><\/p><p>The conditions of sale apply to purchases of goods from the Service. <\/p><p>The prices of the products sold on the Service are indicated next to the products. A fee for shipping is added to the price. <\/p><p>The shipping cost depends on the location of the purchaser and the shipping method. The shipping cost is displayed when the purchaser places the order. <\/p><p>Product information is provided immediately adjacent to the product in the online store.<\/p><p>​<strong>3.​ Placing an order<\/strong><\/p><p>Add the desired products to your shopping basket to order them. Fill in all of the required fields and choose the most suitable shipping method to complete the order. The total cost is then displayed on the screen.<\/p><p>Please note that the order will not be valid if we cannot confirm the billing and shipping address(es) that you provide. Once you have confirmed your order you will receive an immediate online confirmation on your screen at the end of the checkout, as well as a digital order confirmation via email. This confirmation is a receipt of your order online.<\/p><p>The contract enters into force when the amount payable is transferred to the bank account of the Service. <\/p><p>If we cannot deliver the ordered goods due to stock running out or for any other reason, the purchaser will be informed as soon as possible and the money paid (including the shipping cost) will be refunded promptly, but no later than within 14 days of receiving the notification.<\/p><p><strong>​4.​ Payment<\/strong><\/p><p>We accepts payments through VISA, Mastercard, and PayPal.<\/p><p>You represent and warrant that: (i) you have the legal right to use any credit card(s) or other payment method(s) in connection with any Purchase; and that (ii) the information you supply to us is true, correct and complete.<\/p><p>By submitting such information, you grant us the right to provide the information to third parties for purposes of facilitating the completion of Purchases.<\/p><p>We reserve the right to refuse or cancel your order at any time for certain reasons including but not limited to: product or service availability, errors in the description or price of the product or service, error in your order or other reasons.<\/p><p>We reserve the right to refuse or cancel your order if fraud or an unauthorised or illegal transaction is suspected.<\/p><p>Prices of the Service are provided in the following currencies: EUR (EURO). All prices are subject to change. The Service cannot be held responsible for any currency changes or currency exchange rates any bank may have when exchanging the currencies we offer online.<\/p><p><strong>​5.​ Shipment<\/strong><\/p><p>The shipping country within the European Union is chosen at checkout. All prices, currencies, VAT, delivery times and delivery charges will be adjusted depending on the country you would like your items shipped to. We will dispatch the approved orders within 2-4 days (Monday-Friday) or as quickly as possible and in the order that they have been received. Exceptions to this may occur during releases, inventory management, bank holidays and sale periods when handling may take more time.<\/p><p>Estimated delivery times are to be used as a guide only and commence from the date of dispatch. Delivery times are dependent on the country where goods are shipped to and the choice of freight method. We are not responsible for any delays caused by destination customs clearance processes.<\/p><p>If a delivery suffers a delay or if the delivery cannot be dispatched or only partially dispatched due to the goods not being in stock or other reasons, the consumer will be informed about this as quickly as possible or at the latest 14 days after the order was placed. In this case, the consumer will be given the option to terminate the agreement, free of charge. We will refund the consumer in full, at the latest within 14 days after termination.<\/p><p>Our service is not responsible for orders that are lost in transit and that are not delivered. We will provide proof that the order has been shipped. We will try our best to work with you in these rare circumstances.<\/p><p>Stolen Packages<\/p><p>Our service is not responsible for stolen packages. We will provide tracking information from the carrier we used.  It is the responsibility of the customer to provide a safe and correct delivery location. Refunds and site credit will be left to the discretion of our service<\/p><p><strong>​6.​ Pricing, Availability, Errors and Inaccuracies<\/strong><\/p><p>We are constantly updating our offerings of products and services on the Service. The products available on our Service may be mispriced, described inaccurately, or unavailable, and we may experience delays in updating information on the Service and in our advertising on other web sites.<\/p><p>We cannot and do not guarantee the accuracy or completeness of any information, including prices, product images, specifications, availability, and services. We reserve the right to change or update information and to correct errors, inaccuracies, or omissions at any time without prior notice.<\/p><p><strong>​7.​ Cancellation And Right Of Return<\/strong><\/p><p>As a customer within EU you have the right to cancel your purchases without giving any reason within a period of 14 calendar days after the day of delivery of the goods. The goods have to be undamaged and unused, with any labels or tags intact. Returns that are damaged or soiled, washed, altered or worn (other than to try the item on) may not be accepted and may be sent back to the customer and\/or a refund refused. All items returned should include the completed returns note with an order reference number and your contact details. Unidentified returns may not be eligible for a refund.<\/p><p>Upon receiving the returned goods, the Service shall return to the purchaser, immediately but no later than after 14 days, all of the payments received from the purchaser based on the contract.<\/p><p><strong>​7.1.​ Cancellation<\/strong><\/p><p>The Service is responsible for the non-compliance of goods sold to a purchaser with the terms and conditions of the contract or for deficiencies which already existed at the time of delivery and which occur within two years of delivering the goods to the purchaser. Within the first six months of delivery it is assumed that the defect was present at the time of delivery. It is theService´s responsibility to prove otherwise.<\/p><p>The purchaser has the right to turn to the Service within two months of the occurrence of a defect by e-mailing <a href=\"mailto:europe@warmbody-coldmind.com\">europe@warmbody-coldmind.com<\/a><\/p><p>The Service is not liable for any defects arising after delivering the goods to the purchaser.<\/p><p>If goods bought from us have defects for which the Service is responsible, the Service will repair or replace the defective goods. If the goods cannot be repaired or replaced, the Service shall return to the purchaser all of the payments involved in the contract of sale.<\/p><p>The Service will respond to the consumer´s complaint in written form or in a form that enables written reproduction within 14 days. <\/p><p>​<strong>8.​ Contests, Sweepstakes and Promotions<\/strong><\/p><p>Any contests, sweepstakes or other promotions (collectively, “Promotions”) made available through the Service may be governed by rules that are separate from these Terms. If you participate in any Promotions, please review the applicable rules as well as our Privacy Policy. If the rules for a Promotion conflict with these Terms, the Promotion rules will apply.<\/p>","section-bottom-margin":false}},"ae4098a7-1168-4026-babc-51bbcb67edb3":{"type":"section-contact-form","settings":{"heading":"Send us an email","background":true,"divider":false,"section-bottom-margin":false}}},"order":["main","387c97c7-7895-4e21-918a-ab0a3ccb8a3a","ae4098a7-1168-4026-babc-51bbcb67edb3"]}